Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
      case STATE_REMINDER_LIST:
        AppNavigation::enter(STATE_REMINDER_HOME);
        AudioService::beep(80);
        break;

      case STATE_SETTINGS_EDIT:
        SettingsFlow::commitEdit(now);
        break;

      case STATE_SETTINGS_MENU:
        SettingsFlow::leaveMenu();
        break;

      case STATE_SETTINGS_HOME:
        SettingsFlow::exitToClock();
        break;

      case STATE_TIMER_VIEW:
        if (!TimerFeature::isRunning()) {
          TimerFeature::enterEditing();
        }
        break;

      case STATE_TIMER_EDIT:
        AppNavigation::enter(STATE_TIMER_VIEW);
        break;

      case STATE_STOPWATCH:
        AppNavigation::goHome();
        break;

      default:
        break;
    }
  }

  if(ev==EVENT_LONG_PRESS){
    switch(AppNavigation::current()){
      case STATE_REMINDER_LIST:
        RemindersFeature::toggleSelectedActive();
        RemindersFeature::save();
        AppNavigation::markChanged();
        break;

      case STATE_TIMER_VIEW:
        TimerFeature::confirmReset();
        break;

      case STATE_STOPWATCH:
        StopwatchFeature::reset();
        AudioService::beep(120);
        break;

      case STATE_TIMER_ALARM:
        resetTimerAlarm(true);
        break;

      case STATE_SETTINGS_EDIT:
        SettingsFlow::commitEdit(now);
        SettingsFlow::exitToClock();
        break;

      case STATE_SETTINGS_MENU:
      case STATE_SETTINGS_HOME:
        SettingsFlow::save();
        LightingService::refreshSchedule(settings);
        SettingsFlow::exitToClock();
        break;

      default:
        break;
    }
    AudioService::beep(120);
  }
}

bool processEvents(unsigned long now){
  bool processed = false;
  AppEvent event;
  while(dequeueEvent(event)){
    processed = true;
    Services::handleEvent(event, now);
    handleEvent(event, now);
  }
  return processed;
}

bool sameUiRows(const char* row0, const char* row1){
  return lastUiFrameValid &&
    strncmp(lastFlushedRows[0], row0, 16) == 0 &&
    strncmp(lastFlushedRows[1], row1, 16) == 0;
}

void rememberUiRows(const char* row0, const char* row1){
  strncpy(lastFlushedRows[0], row0, 16);
  strncpy(lastFlushedRows[1], row1, 16);
  lastFlushedRows[0][16] = '\0';
  lastFlushedRows[1][16] = '\0';
  lastUiFrameValid = true;
}

void flushUiFrame(){
  (void)flushUiFrame(false);
}

bool flushUiFrame(bool force){
  const char* row0 = UiScreens::row(0);
  const char* row1 = UiScreens::row(1);
  if(!force && sameUiRows(row0, row1)){
    uiTiming.unchangedFrames++;
    return false;
  }

  HardwareRequests::writeDisplayRows(row0, row1);
  rememberUiRows(row0, row1);
  uiTiming.framesFlushed++;
  return true;
}

UiScreens::TimerScreenData timerScreenData(unsigned long now){
  UiScreens::TimerScreenData data = {
    TimerFeature::isRunning(),
    TimerFeature::totalMillis(),
    TimerFeature::remainingMillis(now),
    TimerFeature::hours(),
    TimerFeature::minutes(),
    TimerFeature::seconds(),
    (uint8_t)TimerFeature::editField()
  };
  return data;
}

UiScreens::StopwatchScreenData stopwatchScreenData(){
  UiScreens::StopwatchScreenData data = {
    StopwatchFeature::elapsed()
  };
  return data;
}

UiScreens::RemindersScreenData remindersScreenData(){
  uint8_t nextHour = 0;
  uint8_t nextMinute = 0;
  bool hasNext = RemindersFeature::getNext(nextHour, nextMinute);

  UiScreens::RemindersScreenData data = {
    RemindersFeature::MAX_REMINDERS,
    RemindersFeature::selectedIndex(),
    RemindersFeature::selectedActive(),
    RemindersFeature::selectedHour(),
    RemindersFeature::selectedMinute(),
    (uint8_t)RemindersFeature::editField(),
    hasNext,
    nextHour,
    nextMinute,
    RemindersFeature::activeAlarmIndex(),
    RemindersFeature::activeAlarmHour(),
    RemindersFeature::activeAlarmMinute()
  };
  return data;
}

void runBuzzerTask(FrameContext &context){
  (void)context;
  AudioService::service();
}

void runEsp8266LinkTask(FrameContext &context){
  Services::update(context.nowMs);
}

void runHardwareRequestTask(FrameContext &context){
  (void)context;
  HardwareRequests::executePending();
}

void runLightingTask(FrameContext &context){
  (void)context;
  DeviceSettings &settings = SettingsFlow::settings();
  LightingService::refreshSchedule(settings);
}

void runTimerTask(FrameContext &context){
  const unsigned long now = context.nowMs;

  if(AppNavigation::current()==STATE_TIMER_ALARM && TimerFeature::shouldAlarmBeep(now)){
    AudioService::beep(200);
  }
  if(AppNavigation::current()==STATE_TIMER_ALARM && TimerFeature::alarmTimedOut(now)){
    enqueueTimerEvent(EVENT_TIMER_ALARM_TIMEOUT);
  }

  TimerService::update(now);
}

void runReminderCheckTask(FrameContext &context){
  (void)context;
  checkReminders();
}

void runReminderAlarmTask(FrameContext &context){
  updateReminderAlarm(context.nowMs);
}

void runNavMonitorTask(FrameContext &context){
  monitorLongPressHome(context.nowMs);
}

void monitorLongPressHome(unsigned long now){
  // Read current button state (pressed = LOW on input pullup)
  bool buttonPressed = (digitalRead(ENCODER_BUTTON_PIN) == LOW);
  
  // Button press started
  if(buttonPressed && !buttonPressedPrevious){
    buttonPressStartMs = now;
    longPressHomePending = false;
    LOG_INFO(LogTag::APP, "[NAV] Button pressed, monitoring for long press home");
  }
  
  // Button is being held
  if(buttonPressed && buttonPressedPrevious){
    unsigned long pressedDurationMs = now - buttonPressStartMs;
    
    // Show visual feedback at threshold (but don't trigger yet)
    if(!longPressHomePending && pressedDurationMs >= VISUAL_FEEDBACK_THRESHOLD){
      LOG_INFO(LogTag::APP, "[NAV] Visual feedback threshold reached (%ldms)", pressedDurationMs);
      // Could set a flag here to show "Returning Home..." on screen
    }
    
    // Trigger long press home at threshold
    if(pressedDurationMs >= LONG_PRESS_HOME_DURATION && !longPressHomePending){
      longPressHomePending = true;
      LOG_INFO(LogTag::APP, "[NAV] Long press home triggered (%ldms)", pressedDurationMs);
      AppNavigation::goHome();
      AudioService::beep(200);  // Distinct beep for long press home
    }
  }
  
  // Button released
  if(!buttonPressed && buttonPressedPrevious){
    if(longPressHomePending){
      LOG_INFO(LogTag::APP, "[NAV] Long press home completed");
    }
    longPressHomePending = false;
  }
  
