Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
  buttonPressedPrevious = buttonPressed;
}

void runInputTask(FrameContext &context){
  (void)context;
  EventType inputEvent=InputService::readEvent();
  if(inputEvent!=EVENT_NONE){
    int8_t direction = 0;
    if(inputEvent==EVENT_ROTATE_CW) direction = 1;
    else if(inputEvent==EVENT_ROTATE_CCW) direction = -1;
    enqueueEncoderEvent(inputEvent, direction);
  }
}

void runEventTask(FrameContext &context){
  if(processEvents(context.nowMs)){
    runLightingTask(context);
  }
  
  // Check for idle timeout and auto-return to dashboard
  if(IdleManager::update(context.nowMs)){
    // Idle timeout reached - return to home
    if(!AppNavigation::isAtHome()){
      LOG_INFO(LogTag::APP, "[IDLE] Auto-return to dashboard triggered");
      AppNavigation::goHome();
      AudioService::beep(150);  // Short beep for auto-return
    }
  }
}

void runUiTask(FrameContext &context){
  AppNavigation::commit();
  const uint32_t frameStartUs = micros();
  const unsigned long now = context.nowMs;
  DeviceSettings &settings = SettingsFlow::settings();

  uiTiming.decisionUs = 0;
  uiTiming.dataUs = 0;
  uiTiming.menuDrawingUs = 0;
  uiTiming.textRenderingUs = 0;
  uiTiming.iconRenderingUs = 0;
  uiTiming.animationRenderingUs = 0;
  uiTiming.displayRenderingUs = 0;
  uiTiming.spiTransferUs = 0;
  uiTiming.frameUs = 0;

  const uint32_t decisionStartUs = micros();
  const bool stateChanged = AppNavigation::hasStateChanged();
  const bool buildFrame = shouldBuildUiFrame(now, stateChanged);
  uiTiming.decisionUs = micros() - decisionStartUs;

  if(!buildFrame){
    uiTiming.framesSkipped++;
    uiTiming.frameUs = micros() - frameStartUs;
    return;
  }

  if(stateChanged){
    AppNavigation::clearStateChanged();
  }

  const uint32_t blinkStartUs = micros();
  (void)updateBlinkState(now);
  uiTiming.animationRenderingUs += micros() - blinkStartUs;

  const AppState currentState = AppNavigation::current();
  uiTiming.framesBuilt++;

  switch(currentState){
    case STATE_CLOCK: {
      const uint32_t animationStartUs = micros();
      ClockFeature::update(now,settings.quotes,settings.format24);
      uiTiming.animationRenderingUs += micros() - animationStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderClockScreen(ClockFeature::timeRow(),ClockFeature::quoteRow());
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }

    case STATE_TIMER_VIEW:
    case STATE_TIMER_EDIT:
    case STATE_TIMER_ALARM: {
      const uint32_t dataStartUs = micros();
      UiScreens::TimerScreenData data = timerScreenData(now);
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderTimerScreen(currentState,data,systemContext.ui.blinkState);
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }

    case STATE_STOPWATCH: {
      const uint32_t animationStartUs = micros();
      StopwatchFeature::update(now);
      uiTiming.animationRenderingUs += micros() - animationStartUs;

      const uint32_t dataStartUs = micros();
      UiScreens::StopwatchScreenData data = stopwatchScreenData();
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderStopwatchScreen(data);
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }

    case STATE_REMINDER_HOME:
    case STATE_REMINDER_LIST:
    case STATE_REMINDER_EDIT: {
      const uint32_t dataStartUs = micros();
      UiScreens::RemindersScreenData data = remindersScreenData();
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderRemindersScreen(currentState,data,settings.format24,systemContext.ui.blinkState);
      uiTiming.menuDrawingUs += micros() - renderStartUs;
      break;
    }

    case STATE_SETTINGS_HOME:
    case STATE_SETTINGS_MENU:
    case STATE_SETTINGS_EDIT: {
      const uint32_t dataStartUs = micros();
      SettingsFlow::Snapshot snapshot = SettingsFlow::snapshot(FIRMWARE_VERSION,systemContext.ui.blinkState);
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderSettingsScreen(currentState,settings,snapshot);
      uiTiming.menuDrawingUs += micros() - renderStartUs;
      break;
    }

    case STATE_REMINDER_ALARM: {
      const uint32_t dataStartUs = micros();
      UiScreens::RemindersScreenData data = remindersScreenData();
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderReminderAlarmScreen(data);
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }
  }

  const uint32_t displayStartUs = micros();
  const bool flushed = flushUiFrame(false);
  uiTiming.displayRenderingUs = micros() - displayStartUs;
  if(!flushed){
    uiTiming.unnecessaryRedraws++;
  }
  systemContext.ui.lastRefreshMs=now;
  uiTiming.frameUs = micros() - frameStartUs;
  if(uiTiming.frameUs > uiTiming.maxFrameUs){
    uiTiming.maxFrameUs = uiTiming.frameUs;
  }
}

void runDiagnosticsTask(FrameContext &context){
  static uint32_t lastLedPerfMs = 0;
  static uint32_t lastLedPerfTx = 0;
  static uint32_t lastLedPerfAck = 0;
  static uint32_t lastLedPerfRetry = 0;
  static uint32_t lastLedPerfUartTxBytes = 0;

  const SchedulerStats &schedulerStats = scheduler.stats();
  const HardwareRequestStats &hardwareStats = HardwareRequests::stats();
  const EventQueueStats &eventStats = eventQueueStats();
  const FaultSnapshot &faults = FaultTracker::snapshot();
  const FaultRecord &lastFault = faults.lastFault;
  const Esp8266LinkDiagnostics &link = Esp8266Link::diagnostics();
  const UartMonitorStats &uart = UartTrafficMonitor::stats();
  const uint32_t ledPerfElapsedMs = lastLedPerfMs == 0 ? 0 : context.nowMs - lastLedPerfMs;
  const uint32_t ledTxDelta = link.ledTx - lastLedPerfTx;
  const uint32_t ledAckDelta = link.ledAck - lastLedPerfAck;
  const uint32_t ledRetryDelta = link.ledRetry - lastLedPerfRetry;
  const uint32_t uartTxByteDelta = uart.txBytes - lastLedPerfUartTxBytes;
  const uint32_t ledTxPerMinute =
    ledPerfElapsedMs == 0 ? 0 : (uint32_t)(((uint64_t)ledTxDelta * 60000ULL) / ledPerfElapsedMs);
  const uint32_t uartTxBytesPerMinute =
    ledPerfElapsedMs == 0 ? 0 : (uint32_t)(((uint64_t)uartTxByteDelta * 60000ULL) / ledPerfElapsedMs);

  lastLedPerfMs = context.nowMs;
  lastLedPerfTx = link.ledTx;
  lastLedPerfAck = link.ledAck;
  lastLedPerfRetry = link.ledRetry;
  lastLedPerfUartTxBytes = uart.txBytes;

  LOG_INFO(
    LogTag::APP,
    "sched loops=%lu tasks=%lu events q=%lu d=%lu drop=%u max=%u seq=%u hw q=%lu x=%lu drop=%u max=%u seq=%u age=%lums",
    (unsigned long)schedulerStats.loopCount,
    (unsigned long)schedulerStats.taskRunCount,
    (unsigned long)eventStats.queued,
    (unsigned long)eventStats.dequeued,
    eventStats.dropped,
    eventStats.maxDepth,
    eventStats.lastSequenceId,
    (unsigned long)hardwareStats.queued,
    (unsigned long)hardwareStats.executed,
    hardwareStats.dropped,
    hardwareStats.maxDepth,
    hardwareStats.lastSequenceId,
    (unsigned long)hardwareStats.maxCommandAgeMs
  );

  LOG_INFO(
    LogTag::APP,
    "OVERRUN count=%lu task=%s runtime=%luus budget=%luus excess=%luus at=%lums maxLoopActual=%luus",
    (unsigned long)schedulerStats.overrunCount,
    schedulerStats.lastOverrunTaskName != nullptr ? schedulerStats.lastOverrunTaskName : "none",
    (unsigned long)schedulerStats.lastOverrunRuntimeUs,
    (unsigned long)schedulerStats.lastOverrunBudgetUs,
    (unsigned long)schedulerStats.lastOverrunExcessUs,
    (unsigned long)schedulerStats.lastOverrunTimestampMs,
    (unsigned long)schedulerStats.maxLoopRuntimeUs
  );

  const LcdDriver::TimingStats &lcdTiming = LcdDriver::timingStats();
  LOG_INFO(
    LogTag::APP,
    "LCD_TIMING clear=%luus row1=%luus row2=%luus frame=%luus setCursor=%luus print=%luus write=%luus maxFrame=%luus ops clear=%lu frame=%lu cursor=%u print=%u write=%u chars=%u rows=%u skipped=%u runs=%u/%u",
    (unsigned long)lcdTiming.clearUs,
    (unsigned long)lcdTiming.row1Us,
    (unsigned long)lcdTiming.row2Us,
    (unsigned long)lcdTiming.frameUs,
    (unsigned long)lcdTiming.setCursorUs,
    (unsigned long)lcdTiming.printUs,
    (unsigned long)lcdTiming.writeUs,
    (unsigned long)lcdTiming.maxFrameUs,
    (unsigned long)lcdTiming.clearCount,
    (unsigned long)lcdTiming.frameUpdateCount,
    (unsigned)lcdTiming.lastFrameSetCursorOps,
    (unsigned)lcdTiming.lastFramePrintOps,
    (unsigned)lcdTiming.lastFrameWriteOps,
    (unsigned)lcdTiming.lastFrameChangedChars,
    (unsigned)lcdTiming.lastFrameRowsChanged,
    (unsigned)lcdTiming.lastFrameRowsSkipped,
    (unsigned)lcdTiming.lastRow1Runs,
    (unsigned)lcdTiming.lastRow2Runs
  );

  LOG_INFO(
    LogTag::APP,
    "UI_TIMING frame=%luus max=%luus decision=%luus data=%luus menu=%luus text=%luus icon=%luus animation=%luus display=%luus spi=%luus built=%lu flushed=%lu skipped=%lu unchanged=%lu full=%lu unnecessary=%lu",
    (unsigned long)uiTiming.frameUs,
    (unsigned long)uiTiming.maxFrameUs,
    (unsigned long)uiTiming.decisionUs,
    (unsigned long)uiTiming.dataUs,
    (unsigned long)uiTiming.menuDrawingUs,
    (unsigned long)uiTiming.textRenderingUs,
    (unsigned long)uiTiming.iconRenderingUs,
    (unsigned long)uiTiming.animationRenderingUs,
    (unsigned long)uiTiming.displayRenderingUs,
    (unsigned long)uiTiming.spiTransferUs,
    (unsigned long)uiTiming.framesBuilt,
    (unsigned long)uiTiming.framesFlushed,
    (unsigned long)uiTiming.framesSkipped,
    (unsigned long)uiTiming.unchangedFrames,
    (unsigned long)uiTiming.fullScreenRedraws,
    (unsigned long)uiTiming.unnecessaryRedraws
  );

  LOG_INFO(
    LogTag::APP,
    "LED_STATE desired=%s/%u/%u/%u active=%s/%u/%u/%u sent=%s/%u/%u/%u pending=%s/%u/%u/%u status=%s retry=%u ackAge=%lums err=%s counts tx=%lu ack=%lu retry=%lu dupIgnored=%lu",
    link.desiredLedMode,
    link.desiredLedPower ? 1 : 0,
    link.desiredLedBrightness,
    link.desiredLedSpeed,
    link.activeLedMode,
    link.activeLedPower ? 1 : 0,
    link.activeLedBrightness,
    link.activeLedSpeed,
    link.lastSentLedMode,
    link.lastSentLedPower ? 1 : 0,
    link.lastSentLedBrightness,
    link.lastSentLedSpeed,
    link.pendingLedMode,
    link.pendingLedPower ? 1 : 0,
    link.pendingLedBrightness,
    link.pendingLedSpeed,
    Esp8266Link::ledStatusName(link.ledStatus),
    link.ledRetryCount,
    link.lastLedAckMs == 0 ? 0UL : (unsigned long)(context.nowMs - link.lastLedAckMs),
    link.lastLedErrReason,
    (unsigned long)link.ledTx,
    (unsigned long)link.ledAck,
    (unsigned long)link.ledRetry,
    (unsigned long)link.ledDuplicateIgnored
  );

  LOG_INFO(
    LogTag::APP,
    "LED_PERF interval=%lums txDelta=%lu ackDelta=%lu retryDelta=%lu txRate=%lu/min uartTxBytesDelta=%lu uartTxBytesRate=%lu/min",
    (unsigned long)ledPerfElapsedMs,
    (unsigned long)ledTxDelta,
    (unsigned long)ledAckDelta,
    (unsigned long)ledRetryDelta,
    (unsigned long)ledTxPerMinute,
    (unsigned long)uartTxByteDelta,
    (unsigned long)uartTxBytesPerMinute
  );

